app/controllers/home_controller.rb

	def home
		@links = Link.all.order(:cached_votes_up => :desc)
---
SELECT "links".* FROM "links" ORDER BY "links"."cached_votes_up" DESC