app/controllers/links_controller.rb

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@link = Link.find(params[:id])

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@link = Link.find(params[:id])

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "6"]]
---
	def upvote
		@link = Link.find(params[:id])

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "6"]]
---
	def downvote
		@link = Link.find(params[:id])

INSERT INTO "links" ("created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 05 Apr 2015 05:58:40 UTC +00:00], ["title", "google"], ["updated_at", Sun, 05 Apr 2015 05:58:40 UTC +00:00], ["url", "google.com"], ["user_id", 2]]
---
	def create
		link = current_user.links.new(link_params)

		respond_to do | format |
			if link.save

SELECT "links".* FROM "links" WHERE "links"."user_id" = ? AND "links"."id" = ? LIMIT 1  [["user_id", 2], ["id", "2"]]
UPDATE "links" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "links"."id" = 6  [["title", "yahoo"], ["url", "yahoo.com"], ["updated_at", Sun, 05 Apr 2015 06:15:50 UTC +00:00]]
---
	def update
		link = current_user.links.find(params[:id])

		respond_to do | format |
			if link.update_attributes(link_params)

SELECT "links".* FROM "links" WHERE "links"."user_id" = ? AND "links"."id" = ? LIMIT 1  [["user_id", 2], ["id", "1"]]
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
---
	def destroy
		link = current_user.links.find(params[:id])
		respond_to do | format |
			if link.destroy